# Тема 2. Встроенные типы и операции с ними

# ======================================================================================================================
# 1: Даны два произвольные списка. Удалите из первого списка элементы присутствующие во втором списке.
#    Примечание. Списки создайте вручную, например так:
# my_list_1 = [2, 5, 8, 2, 12, 12, 4]
# my_list_2 = [2, 7, 12, 3]
#-----------------------------------------------------------------------------------------------------------------------
# Вариант А.
# Преобразуем списки в множества и вычитаем из первого второе
print('===============================================')

my_list_1 = [2, 5, 8, 2, 12, 12, 4]
my_list_2 = [2, 7, 12, 3]

my_list_1 = list(set(my_list_1) - set(my_list_2))
print(my_list_1)

print('-----------------------------------------------')
#-----------------------------------------------------------------------------------------------------------------------
# Вариант B.
# Перебираем второй список, и те его элементы, которые есть в первом, удаляем из первого списка

my_list_1 = [2, 5, 8, 2, 12, 12, 4]
my_list_2 = [2, 7, 12, 3]

for elem in my_list_2:
    while elem in my_list_1:
        my_list_1.remove(elem)

print(my_list_1)

# ======================================================================================================================
# 2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013. Ваша задача — вывести дату в текстовом виде, например:
# второе ноября 2013 года. Склонением пренебречь (2000 года, 2010 года)
#-----------------------------------------------------------------------------------------------------------------------
# Создадим словари с датами и месяцами. Разобьем входную строку по точкам и выведем соотвествующие элементы словарей

print('===============================================')

data_dict = {"01" : 'первое', "02" : "второе", "03" : "третье", "04" : "четвертое", "05" : "пятое", "06" : "шестое",
        "07" : 'седьмое', "08" : "восьмое", "09" : "девятое", "10" : "десятое", "11" : "одиннадцатое",
        "12" : 'двенадцатое', "13" : "тринадцатое", "14" : "четырнадцатое", "15" : "пятнадцатое", "16" : "шестнадцатое",
        "17" : 'семнадцатое', "18" : "воемнадцатое", "19" : "девятнадцатое", "20" : "двадцатое", "21" : "двадцать первое",
        "22" : 'двадцать второе', "23" : "двадцать третье", "24" : "двадцать четвертое", "25" : "двадцать пятое",
        "26" : 'двадцать шестое', "27" : "двадцать седьмое", "28" : "двадцать восьмое", "29" : "двадцать девятое",
        "30" : 'тридцатое', "31" : "тридцать первое"}
month_dict = {"01" : 'января', "02" : "февраля", "03" : "марта", "04" : "апреля", "05" : "мая", "06" : "июня",
        "07" : 'июля', "08" : "августа", "09" : "сентября", "10" : "октября", "11" : "ноября", "12" : "декабря" }

input_str = '02.11.2013'
data, month, year = input_str.split('.')
if data in data_dict and month in month_dict:
    print(input_str)
    print('{} {} {} года'.format(data_dict[data], month_dict[month], year))
    print()

input_str = '31.12.1988'
data, month, year = input_str.split('.')
if data in data_dict and month in month_dict:
    print(input_str)
    print('{} {} {} года'.format(data_dict[data], month_dict[month], year))

# ======================================================================================================================
# 3: Дан список заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут только уникальные элементы исходного.
#    Примечание. Списки создайте вручную, например так:
# my_list_1 = [2, 2, 5, 12, 8, 2, 12]
# В этом случае ответ будет:
# [5, 8]
#-----------------------------------------------------------------------------------------------------------------------
# Вариант А.
# Создадим множетво на основе данного списка (чтобы сократить количество переборов). Переберем это множество и, с
# помощью метода count, определим количество таких элементов в исходном списке. Если элемент только один, добавляем его
# в новый список

print('===============================================')

my_list_1 = [2, 2, 5, 12, 8, 2, 12]
my_list_2 = []
my_set = set(my_list_1)
for elem in my_set:
    if my_list_1.count(elem) == 1:
        my_list_2.append(elem)
print(my_list_2)

print('-----------------------------------------------')
#-----------------------------------------------------------------------------------------------------------------------
# Вариант B.
# Перебираем элементы списка и добавляем их в словарь, где ключ == элемент, а значение == количеству таких элементов
# в исходном списке. Переберем все эелементы словаря, и те, значение которых равно 1, добавим в новый список.

my_list_1 = [2, 2, 5, 12, 8, 2, 12]
my_list_2 = []
my_dict = {}
for elem in my_list_1:
    my_dict[elem] = my_dict.get(elem, 0) + 1

for elem in my_dict:
    if my_dict[elem] == 1:
        my_list_2.append(elem)
print(my_list_2)